app/Controllers/Customer.php

SELECT *
FROM `webinar`
WHERE `id` = '1'
---
    public function detailwebinar($id=NULL)
    {
        $deskwebinar = new webinarModel();

        $data = ['deskwebinar' => $deskwebinar->WHERE('id', $id)->find()];